In [2]:
import pandas as pd

### Choosing data in a Series
Let's create a simple series and store it in a variable named “series_1”.

In [3]:
series_1 = pd.Series([2, 3, 4, 5, 6])
series_1

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [4]:
series_1[3]

np.int64(5)

In [5]:
sale = pd.Series([500,85000,40000,9600,100000],index = ['Cookie', 'Choco', 'Toothpaste', 'Soap', 'Toffee'])
sale

Cookie           500
Choco          85000
Toothpaste     40000
Soap            9600
Toffee        100000
dtype: int64

In [6]:
sale['Toffee']

np.int64(100000)

### Choosing data in Data frame
As discussed before, a data frame is a two-dimensional data structure with rows and columns. The Rows and columns in a data frame are indexed separately and can be used to select the data we need for our analysis.

Let's create a simple data frame with three columns state, year and pop (population).

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data = pd.DataFrame(data)
data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### Selecting columns in a data frame

In our example, we will select the column 'state' from the data frame, and the result will show us all the data stored in that column. There are two ways to select the column.

In [8]:
data.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [9]:
data['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [10]:
data.pop

<bound method DataFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [11]:
data['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [12]:
data[['pop', 'state']]

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [14]:
df = pd.read_csv('../survey_results_public.csv', usecols=['Age','ConvertedComp', 'Country', 'LanguageWorkedWith', 'YearsCode'])
df

,Age,ConvertedComp,Country,LanguageWorkedWith,YearsCode
0,NaN,NaN,Germany,C#;HTML/CSS;JavaScript,36
1,NaN,NaN,United Kingdom,JavaScript;Swift,7
2,NaN,NaN,Russian Federation,Objective-C;Python;Swift,4
3,25.0,NaN,Albania,NaN,7
4,31.0,NaN,United States,HTML/CSS;Ruby;SQL,15
...,...,...,...,...,...
64456,NaN,NaN,United States,NaN,10
64457,NaN,NaN,Morocco,Assembly;Bash/Shell/PowerShell;C;C#;C++;Dart;G...,NaN
64458,NaN,NaN,Viet Nam,NaN,NaN
64459,NaN,NaN,Poland,HTML/CSS,NaN
64460,NaN,NaN,Spain,C#;HTML/CSS;Java;JavaScript;SQL,NaN

### iloc

Let's get the value stored at row number 1 and column number 2 using iloc.

In [18]:
dato = df.iloc[1,2]
dato

'United Kingdom'

In [19]:
dato = df.iloc[2:9,2]
dato

2    Russian Federation
3               Albania
4         United States
5               Germany
6                 India
7         United States
8               Tunisia
Name: Country, dtype: object

In [20]:
df_subset = df.iloc[1:50000]
df_subset

,Age,ConvertedComp,Country,LanguageWorkedWith,YearsCode
1,NaN,NaN,United Kingdom,JavaScript;Swift,7
2,NaN,NaN,Russian Federation,Objective-C;Python;Swift,4
3,25.0,NaN,Albania,NaN,7
4,31.0,NaN,United States,HTML/CSS;Ruby;SQL,15
5,NaN,NaN,Germany,HTML/CSS;Java;JavaScript,6
...,...,...,...,...,...
49995,29.0,27864.0,Croatia,HTML/CSS;JavaScript;PHP;SQL;TypeScript,8
49996,NaN,112456.0,United Kingdom,Bash/Shell/PowerShell;Python,40
49997,56.0,131844.0,United Kingdom,Bash/Shell/PowerShell;C#;HTML/CSS;Java;JavaScr...,41
49998,42.0,82000.0,United States,Java;JavaScript;SQL,26
49999,NaN,53184.0,Germany,HTML/CSS;JavaScript;PHP;SQL,20

### loc

As discussed loc function can use either index position or label for rows. So let's select data in column LanguageWorkedWith from 500 to 550.

But wait a minute, why did we not write row 551 to get row 550 in the loc function? Here it is important to remember the loc function works on labels, even integer-based locations treated as labels. That's why the output we will get from 550 to 550, unlike the iloc function from 550 to 549.

In [21]:
subset = df.loc[500:550, 'LanguageWorkedWith']
subset

500                                          C#;HTML/CSS
501            Bash/Shell/PowerShell;C#;Dart;Java;Kotlin
502                                                  SQL
503       C++;HTML/CSS;Java;JavaScript;Python;TypeScript
504               C#;HTML/CSS;Java;JavaScript;Python;SQL
505                C;C++;HTML/CSS;Java;JavaScript;Python
506                                               Python
507                                  HTML/CSS;JavaScript
508                   Bash/Shell/PowerShell;C;C++;Python
509                             HTML/CSS;JavaScript;Ruby
510                         Bash/Shell/PowerShell;Python
511                C#;HTML/CSS;JavaScript;SQL;TypeScript
512         JavaScript;Kotlin;Python;Ruby;SQL;TypeScript
513    Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;K...
514       Bash/Shell/PowerShell;C#;JavaScript;Python;SQL
515    Bash/Shell/PowerShell;C#;Go;Java;Kotlin;Python...
516                                               Python
517                Bash/Shell/PowerShell;Java;Python;SQL
518                C#;HTML/CSS;JavaScript;SQL;TypeScript
519                C#;HTML/CSS;JavaScript;PHP;Python;SQL
520            Go;Haskell;HTML/CSS;JavaScript;TypeScript
521    Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;PHP;...
522               C++;HTML/CSS;JavaScript;PHP;Python;SQL
523               Bash/Shell/PowerShell;Python;R;SQL;VBA
524    Bash/Shell/PowerShell;C;C++;Go;HTML/CSS;Java;J...
525       Bash/Shell/PowerShell;HTML/CSS;JavaScript;Perl
526                           HTML/CSS;Java;Python;R;SQL
527    Bash/Shell/PowerShell;C++;HTML/CSS;JavaScript;...
528                       HTML/CSS;JavaScript;TypeScript
529                                                Swift
530    Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;S...
531                                          Java;Python
532        C#;Go;HTML/CSS;JavaScript;Ruby;SQL;TypeScript
533                                                    R
534                                      C#;HTML/CSS;SQL
535    Bash/Shell/PowerShell;C#;HTML/CSS;Java;JavaScr...
536                             C#;JavaScript;TypeScript
537    Bash/Shell/PowerShell;C;HTML/CSS;JavaScript;PH...
538                 C;C++;HTML/CSS;Java;JavaScript;R;SQL
539                               Java;JavaScript;Python
540           Bash/Shell/PowerShell;Go;HTML/CSS;Java;SQL
541                                                   C#
542               C#;Go;JavaScript;Python;SQL;TypeScript
543                       C#;HTML/CSS;JavaScript;PHP;SQL
544                          HTML/CSS;JavaScript;PHP;SQL
545                                                 Java
546    Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...
547                    Java;JavaScript;Kotlin;TypeScript
548    Bash/Shell/PowerShell;C;Go;HTML/CSS;Java;JavaS...
549                   HTML/CSS;JavaScript;PHP;Python;SQL
550                                    Objective-C;Swift
Name: LanguageWorkedWith, dtype: object

In [22]:
subset = df.loc[[1,2,3,4,5], ['Age', 'Country', 'ConvertedComp']]
subset

    Age             Country  ConvertedComp
1   NaN      United Kingdom            NaN
2   NaN  Russian Federation            NaN
3  25.0             Albania            NaN
4  31.0       United States            NaN
5   NaN             Germany            NaN

### Bonus Section
Bonus Section So far, we have worked with rows with their index position numbers. We may want to use a column as the index in some scenarios. Let’s convert the Country column to index. Remember that the country column data will now be in the index, and there will be no more Country column in the data frame.

In [23]:
df.set_index('Country', inplace=True)
df

,Age,ConvertedComp,LanguageWorkedWith,YearsCode
Country,,,,
Germany,NaN,NaN,C#;HTML/CSS;JavaScript,36
United Kingdom,NaN,NaN,JavaScript;Swift,7
Russian Federation,NaN,NaN,Objective-C;Python;Swift,4
Albania,25.0,NaN,NaN,7
United States,31.0,NaN,HTML/CSS;Ruby;SQL,15
...,...,...,...,...
United States,NaN,NaN,NaN,10
Morocco,NaN,NaN,Assembly;Bash/Shell/PowerShell;C;C#;C++;Dart;G...,NaN
Viet Nam,NaN,NaN,NaN,NaN
Poland,NaN,NaN,HTML/CSS,NaN
Spain,NaN,NaN,C#;HTML/CSS;Java;JavaScript;SQL,NaN

In [24]:
df.loc[['Morocco', 'United States'], 'Age': 'LanguageWorkedWith']

,Age,ConvertedComp,LanguageWorkedWith
Country,,,
Morocco,26.0,8256.0,Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;SQL
Morocco,28.0,21312.0,C#;HTML/CSS;Java;JavaScript;PHP;R;SQL;TypeScript
Morocco,NaN,NaN,HTML/CSS;JavaScript;Python;SQL
Morocco,21.0,NaN,HTML/CSS;Java;JavaScript;Kotlin;SQL
Morocco,20.0,NaN,C;C#;C++;HTML/CSS;Java;JavaScript;PHP;SQL
...,...,...,...
United States,32.0,NaN,Assembly;Bash/Shell/PowerShell;C;C#;C++;Dart;G...
United States,29.0,NaN,Haskell
United States,NaN,NaN,Bash/Shell/PowerShell;HTML/CSS;PHP
United States,NaN,NaN,C++;HTML/CSS;Java;JavaScript;Python;SQL
United States,NaN,NaN,NaN